#include <stdio.h> //подключение библ. ввода/вывода
#include <math.h> //подкл. библ. мат. функций
#include <locale.h> // подкл. библ. для русского языка

int main() {
	setlocale(LC_ALL, "Rus");// перевод консоли на русский язык
	printf("Задание 1 ----------------------------------------------\n");
	int x1, x2, x3, y1, y2, y3; // инициализация переменных для координат точек в различных заданиях
	float p; // инициализация переменных для расстояния
	printf("Введите x1=");
	scanf_s("%i", &x1);
	printf("Введите y1=");
	scanf_s("%i", &y1);
	printf("Введите x2=");
	scanf_s("%i", &x2);
	printf("Введите y2=");
	scanf_s("%i", &y2);
	p = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1));// вычисление расстояния
	printf("Растояние равно %.2f", p);
	printf("\n");
	//---------------------------------------------------------------
	printf("Задание 2 ----------------------------------------------\n");
	int sum; // переменная для суммы длин отрезков
	float ac, bc; // для вычисления длины отрезков
	printf("Введите точку A\n");
	scanf_s("%x1", &x1);
	printf("Введите точку B\n");
	scanf_s("%x2", &x2);
	printf("Введите точку С\n");
	scanf_s("%x1", &x3);
	ac = abs(x3 - x1); // отрезок ac
	bc = abs(x2 - x3); // отрезок bc
	sum = ac + bc;// сумма отрезков
	printf("AC=%.2f BC=%.2f Сумма отрезков=%i\n", ac, bc, sum);
	printf("\n");
	//----------------------------------------------------------------
	printf("Задание 3 ----------------------------------------------\n");
	int pr; // переменная для произведения длин отрезков
	printf("Введите точку A\n");
	scanf_s("%x1", &x1);
	printf("Введите точку B\n");
	scanf_s("%x2", &x2);
	printf("Введите точку С\n");
	scanf_s("%x1", &x3);
	ac = abs(x3 - x1); // отрезок ac
	bc = abs(x2 - x3); // отрезок bc
	pr = ac * bc; // произведение отрезков
	printf("Произвдение длин=%i", pr);
	printf("\n");
	//---------------------------------------------------------------
	printf("Задание 4 ----------------------------------------------\n");
	int per, l1, l2; // переменные для периметра и длин сторон прямоугольника
	float s; // для площади прямоугольника
	printf("Введите x1=");
	scanf_s("%i", &x1);
	printf("Введите x2=");
	scanf_s("%i", &x2);
	printf("Введите y1=");
	scanf_s("%i", &y1);
	printf("Введите y2=");
	scanf_s("%i", &y2);
	l1 = abs(x2 - x1); //первая сторона
	l2 = abs(y2 - y1); // вторая сторона
	per = 2 * l1 + 2 * l2; // периметр
	s = l1 * l2; // площадь
	printf("Периметр=%i Площадь=%.2f\n", per, s);
	//-------------------------------------------------------------
	printf("Задание 5 ----------------------------------------------\n");
	float ab, h; // переменные нахождения площади треугольника
	int xh, yh; // переменные для нахождения длины высоты
	printf("Введите x1=");
	scanf_s("%i", &x1);
	printf("Введите y1=");
	scanf_s("%i", &y1);
	printf("Введите x2=");
	scanf_s("%i", &x2);
	printf("Введите y2=");
	scanf_s("%i", &y2);
	printf("Введите x3=");
	scanf_s("%i", &x3);
	printf("Введите y3=");
	scanf_s("%i", &y3);
	ac = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1));// длина ac
	bc = sqrt((x2 - x3) * (x2 - x3) + (y2 - y3) * (y2 - y3));// длина bc
	ab = sqrt((x3 - x1) * (x3 - x1) + (y3 - y1) * (y3 - y1));// длина ab
	per = ac + bc + ab;// периметр
	xh = (x3 + x2) / 2; //координата x конца высоты h
	yh = (y3 + y2) / 2; //координата y конца высоты h
	h = sqrt((xh-x1) * (xh-x1) + (yh-y1)*(yh-y1));//длина высоты
	s = (bc * h)/2; //площадь
	printf("Параметр=%i Площадь=%.0f\n", per, s);
	return 0; // возвращение функции main значения 0
}